# BendingDetailRepesentationFor3dBars Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BendingDetailRepesentationFor3dBars Property
ParameterTypeId Class See Also
---
"View for 3D Shape"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BendingDetailRepesentationFor3dBars { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendingDetailRepesentationFor3dBars As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BendingDetailRepesentationFor3dBars {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace